app/controllers/posts_controller.rb

  def index
    @posts=Post.all.order("context")
---
SELECT "posts".* FROM "posts" ORDER BY context

  def create


    @post=Post.new(context:params[:name],stamping:params[:stamping])
    @post.save
---
INSERT INTO "posts" ("context", "created_at", "updated_at", "stamping") VALUES (?, ?, ?, ?)  [["context", "水野"], ["created_at", "2022-04-11 10:35:27.691986"], ["updated_at", "2022-04-11 10:35:27.691986"], ["stamping", "出勤"]]

  def times
    @posts=Post.all.order("context")
---
SELECT "posts".* FROM "posts" ORDER BY context